Revit 2024 API
ScheduleDefinition.CanFilterByGlobalParameters Method
 Checks whether a field can be used with a global parameter-based filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool CanFilterByGlobalParameters(
	ScheduleFieldId fieldId
)
Visual Basic
Public Function CanFilterByGlobalParameters ( _
	fieldId As ScheduleFieldId _
) As Boolean
Visual C++
public:
bool CanFilterByGlobalParameters(
	ScheduleFieldId^ fieldId
)
Parameters
fieldId
Type: Autodesk.Revit.DB.ScheduleFieldId
 The ID of the field to check.
Return Value
 True if the field can be used with a global parameter-based filter, false otherwise.
Remarks
The global parameter-based filter types are IsAsociatedWith, IsNotAssociatedWith.
Only parameters which have a compatible type with at least one existing global parameter can be filtered.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace